#+Title: Introduction to Java
#+Author: Mikael Svahnberg
#+Email: Mikael.Svahnberg@bth.se
#+Date: 2025-06-05
#+EPRESENT_FRAME_LEVEL: 1
#+OPTIONS: email:t <:t todo:t f:t ':t H:1
#+STARTUP: beamer num

#+LATEX_CLASS_OPTIONS: [10pt,t,a4paper]
#+BEAMER_THEME: BTH2025

* Traversing a Collection: for-each
#+begin_src java
  Customer c = new Customer();
  c.addTicket(new Ticket("Spartacus", "19:00 tonight"));
  c.addTicket(new Ticket("Ben Hur", "15:00 this afternoon"));

  for (Ticket t : c.getTickets()) { // For each element t of the type Ticket in collection c.getTickets()
    System.out.println(t.toString());
  }
#+end_src

#+RESULTS:
: Ticket for Spartacus at 19:00 tonight
: Ticket for Ben Hur at 15:00 this afternoon

* Other forms of Iteration: while
#+begin_src java
  int x = 5;

  while (0 <= x) {
    System.out.print(" " + x);
    x--; // If you forget this line, x will never update and the while loop will continue forever.
  }

  System.out.println();
  System.out.println("x = "+x);
#+end_src

#+RESULTS:
:  5 4 3 2 1 0
: x=-1

- Repeat while some condition tests to ~true~
- Can go on forever, if you are not careful
- Often used if you do not know when to end, e.g.
  - /while (user has not exited the menu)/
  - /while (there are more elements in the database)/
  - /while (there are more lines in this file)/
  - /while (I still have not found a movie that shows tonight)/
- Boolean expression can be arbitrarily complex:
  ~while (index < myTickets.size() && !found && !userAborted)~
* While without index
#+begin_src java
  int f0=0;
  int f1=1;
  int fn=f1 + f0; // Fibonacci Sequence

  while (fn < 100) {
    System.out.print(" " + fn);
    f0 = f1;
    f1 = fn;
    fn = f1 + f0;
  }
#+end_src

#+RESULTS:
:  1 2 3 5 8 13 21 34 55 89
